// Система маршрутизации отвечает за сопоставление входящих запросов с маршрутами
// и на основании результатов сопоставления выбирает для обработки запроса
// определенную конечную точку приложения (endpoint).

//Example 1
//Метод Map

//Example 2
//Параметры маршрута

//Example 3
//Ограничения маршрута

//Example 4
//Передача зависимостей в endpoint

//Example 5
//Сочетание endpoint и middleware

//Example 6
//Получение параметров строки запроса

using Lesson1.Examples.Example1;

new Example1().Run();